Revit 2018 API
DoubleClickOptions Members
The DoubleClickOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DoubleClickOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAction
 Returns the active user's desired action for a particular double-click target.
GetDoubleClickOptions
 Returns the current user's DoubleClickOptions.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsSupportedAction
 Checks whether the specified double-click target supports the specified action.
SetAction
 Changes the double-click action associated with a specified target.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace